stitch-in-time-api/app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages"
---
  def index
    @pages = Page.all

SELECT  "pages".* FROM "pages" WHERE "pages"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @page = Page.find(params[:id])