stitch-in-time-api/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "progress", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Ale"], ["progress", 0], ["created_at", "2019-04-16 17:35:23.223542"], ["updated_at", "2019-04-16 17:35:23.223542"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "Simon"], ["LIMIT", 1]]
---
  def create
    @user = User.find_by(name: user_params[:name]) || User.create(user_params)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "progress" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["progress", 2], ["updated_at", "2019-04-17 15:58:09.601213"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    @user.update(user_params)